"""
Дано послідовність натуральних числень a_1,a_2,...,a_n  .
Використовуючи підпрограму знаходження найбільшої та найменшої цифри, знайти число,
у яке містить найбільшу цифру та число, яке містить найменшу цифру.
"""
n = int(input('Введіть кількість елементів послідовності  :   '))
# Допоміжний код
def maxmin(a):
    maxi = 0
    mini = a
    l = []
    for i in range(len(str(a))):
        if mini >= a % 10:
            mini = a % 10
        if maxi <= a % 10:
            maxi = a % 10
        a //= 10
    l.append(mini)
    l.append(maxi)
    return l
# -----------------------------------------------------------------------------------------------------------------------
# Введення
s = int(input('Введіть 1 елемент послідовності  :  '))
# Присвоєння
j = maxmin(s)
r = j
maxi = s
mini = s
# Перебір елементів
for i in range(n - 1):
    l = int(input('Введіть {0}  елемент послідовності  :  '.format(i + 2)))
    f = maxmin(l)
    if min(f) <= min(j):
        mini = l
        j = f
    if max(f) >= max(r):
        maxi = l
        r = f
# Виведення
print('Число з найбільшою цифрою  =  {0}'.format(maxi))
print('Число з найменшою цифрою  =  {0}'.format(mini))
